{
  "education": [
    {
      "awards_achievements": [
        "Recognition for best final project",
        "GPA: 3.97/4.0"
      ],
      "degree": "Diploma",
      "department": "Cybersecurity",
      "duration": "2022",
      "school_name": "University of Toronto"
    },
    {
      "awards_achievements": null,
      "degree": "High School",
      "department": "HS",
      "duration": "2012-2014",
      "school_name": "Pierre Elliot Trudeau HighSchool"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_KrishChadha",
  "highlighted_projects": [
    {
      "description": "Deploys a security script that activates upon login (guest honeypot user) to catch potential thieves. The script captures a photo from the webcam, connects to the strongest Wi-Fi signal, retrieves the current geolocation, and sends this data to an email or SSH server instantly. It also starts a keylogger to periodically send further information, helping to build a profile on the individual. Additionally, it includes a custom bootloader image that might be noticed by a computer repair shop if the thief attempts to reformat and sell the laptop.",
      "git_url": "https://github.com/cKtheGrey/Anti-Theft-Laptop-Script",
      "name": "Anti-Theft Laptop Script"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Designed and implemented a linux cluster monitoring solution, capturing hardware specs and real-time resource usage data. Stored this data in a PostgreSQL database for generating resource planning reports. Used Bash scripts and automated data collection via cron jobs. Ensured the solution is deployable in a cluster environment, with source code managed on GitHub and the database provisioned using Docker.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_KrishChadha/tree/master/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Krishan Chadha",
  "others": [
    {
      "bullets": [
        "Reading Nonfiction/Sci-Fi",
        "Nutrition/Longevity/Biohacking",
        "Cooking different cuisines"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Designed and implemented monitoring solutions using Linux command-line tools, Bash scripting, and Docker. Created scripts to collect hardware specifications and real-time resource usage data, integrating these with PostgreSQL for storage and reporting. Managed source code with Git and GitHub, adhering to SDLC best practices. Worked closely with tech leads to enhance skills in Java, Python, and SQL. Gained proficiency in cloud computing, DevOps, and big data technologies, while developing strong communication, problem-solving, and leadership abilities.",
      "duration": "2024-present",
      "title": "Technical Consultant"
    },
    {
      "company": "Exchange Bank of Canada",
      "description": "As a Compliance Analyst at the Exchange Bank of Canada, I ensured KYC AML/ATF compliance, prepared FINTRAC reports, monitored transactions, and screened alerts. I collaborated with data scientists to optimize backend systems, reducing false positives and improving alert accuracy. My work involved developing compliance procedures, leveraging analytics for transaction monitoring, and enhancing alert screening processes. I effectively coordinated with various departments and communicated clear reports to senior management, driving efficiency and accuracy in compliance operations.",
      "duration": "2022-2023",
      "title": "Compliance Analyst"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "Python",
      "Networking",
      "Agile/Scrum",
      "Governance/Risk/Compliance"
    ],
    "familiar": [
      "Metasploit",
      "Regex",
      "Wireshark",
      "Burpsuite",
      "Javascript"
    ],
    "proficient": [
      "RDBMS/SQL",
      "Bash",
      "Linux/Windows System Administration",
      "Cloud Computing/Security",
      "Git"
    ]
  },
  "summary": "As a Technical Consultant at Jarvis, I am continually building on the specialized skills I acquired during my Cybersecurity Diploma from the University of Toronto, including bash scripting, cloud security (AWS/GCP), and Linux/Windows system administration. My fascination with software and hardware started when I innocently jailbroke my first iPhone, admiring the skill of the individual who made it possible. This sparked my interest in security and exploits, leading me to pursue expertise in cybersecurity and ethical hacking. My current role, along with my past experience as a compliance analyst coordinating with data scientists, has equipped me with a well-rounded view of cybersecurity from a compliance perspective."
}
